////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция ПодключенныеСправочники() Экспорт
	
	ОписаниеМетаданных = Новый Соответствие;
	ОписаниеМетаданных.Вставить(Метаданные.Справочники.Контрагенты.ПолноеИмя(),Метаданные.Справочники.Контрагенты.Представление());
	ОписаниеМетаданных.Вставить(Метаданные.Справочники.СтатьиДвиженияДенежныхСредств.ПолноеИмя(),Метаданные.Справочники.СтатьиДвиженияДенежныхСредств.Представление());
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеМетаданных);
	
КонецФункции

Функция ПодключенныеДокументы() Экспорт 
	
	ОписаниеМетаданных = Новый Соответствие;
	ОписаниеМетаданных.Вставить(Метаданные.Документы.РасходныйКассовыйОрдер.ПолноеИмя(),Метаданные.Документы.РасходныйКассовыйОрдер.Представление());
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеМетаданных);
	
КонецФункции

Функция РеализованныеМетоды() Экспорт 
	
	ОписаниеШаблона = Новый Соответствие;
	
	КорневойURL = Метаданные.HTTPСервисы.tAPI_Remote.КорневойURL;
	
	Для каждого _ШаблоныURL Из Метаданные.HTTPСервисы.tAPI_Remote.ШаблоныURL Цикл
		                         
		ПолноИмяМетода = _ШаблоныURL.Представление();
		
		ОписаниеШаблона.Вставить(ПолноИмяМетода, Новый Структура);
		
		Для каждого _Метод Из _ШаблоныURL.Методы Цикл
			
			ОписаниеМетода = Новый Структура("Метод, Шаблон, Комментарий", 
				Строка(_Метод.HTTPМетод), 
				СтрШаблон("%1/hs/%2%3", ПолучитьНавигационнуюСсылкуИнформационнойБазы(), КорневойURL, _ШаблоныURL.Шаблон), _ШаблоныURL.Комментарий);
			
			ОписаниеШаблона[ПолноИмяМетода].Вставить(Строка(_Метод.HTTPМетод), ОписаниеМетода);
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеШаблона);
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти