////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция ПодключенныеСправочники() Экспорт
	
	ОписаниеМетаданных = Новый Соответствие;
	ОписаниеМетаданных.Вставить(Метаданные.Справочники.Контрагенты.ПолноеИмя(),Метаданные.Справочники.Контрагенты.Представление());
	ОписаниеМетаданных.Вставить(Метаданные.Справочники.СтатьиДвиженияДенежныхСредств.ПолноеИмя(),Метаданные.Справочники.СтатьиДвиженияДенежныхСредств.Представление());
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеМетаданных);
	
КонецФункции

Функция ПодключенныеДокументы() Экспорт 
	
	ОписаниеМетаданных = Новый Соответствие;
	ОписаниеМетаданных.Вставить(Метаданные.Документы.РасходныйКассовыйОрдер.ПолноеИмя(),Метаданные.Документы.РасходныйКассовыйОрдер.Представление());
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеМетаданных);
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти