#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДанныеДляПакетаОбмена() Экспорт
	
	Контейнер = Новый Массив;
	
	Поиск = Новый Запрос("ВЫБРАТЬ
			|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка,
			|	СтатьиДвиженияДенежныхСредств.Наименование КАК Наименование
			|ИЗ
			|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
			|ГДЕ
			|	НЕ СтатьиДвиженияДенежныхСредств.ПометкаУдаления");
	
	Выборка = Поиск.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		данные = Новый Структура("URL,UUID,name", ПолучитьНавигационнуюСсылку(Выборка.Ссылка), XMLСтрока(Выборка.Ссылка), Выборка.Наименование);
		Контейнер.Добавить(данные);
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Контейнер);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли