////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция ПолучитьИнформациюGET(Запрос) Экспорт 
	
	Идентификатор = Запрос["ПараметрыURL"].Получить("ID");
	Спецификация = CloudEvents.JSONEventSpec();
	
	// todo: переопределить в отдельный модуль с постфиксом _ПЕРЕОПРЕДЕЛЯЕМЫЙ
	Если Идентификатор = "СтатьиДвиженияДенежныхСредств" Тогда
		Спецификация.data = Новый Структура("list", СписокСтатейДДС());
		Спецификация.type = "v83.reference.СтатьиДвиженияДенежныхСредств";
		Спецификация.data.Вставить("count",Спецификация.data.list.Количество());
	ИначеЕсли Идентификатор = "Контрагенты" Тогда
		Спецификация.data = Новый Структура("list", СписокКонтрагентов());
		Спецификация.type = "v83.reference.Контрагенты";
		Спецификация.data.Вставить("count",Спецификация.data.list.Количество());
	КонецЕсли; 

	Спецификация.source = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Спецификация);
	Исключение
		
		ЗаписьЖурналаРегистрации("Marshalling", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		
		Ответ = Новый HTTPСервисОтвет(501);
		CloudEvents.ОбогатитьЗаголовки(Ответ.Заголовки);

		Ответ.УстановитьТелоИзСтроки(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Ответ;
		
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	CloudEvents.ОбогатитьЗаголовки(Ответ.Заголовки);
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокКонтрагентов()
	
	Возврат Справочники.Контрагенты.ДанныеДляПакетаОбмена();
	
КонецФункции

Функция СписокСтатейДДС()	
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.ДанныеДляПакетаОбмена();
КонецФункции
#КонецОбласти

